Writerside/uml/seq.puml
@startuml
participant User
participant System
participant Database

User -> System: Request data
activate System
System -> Database: Retrieve data
activate Database
Database --> System: Return data
deactivate Database
System --> User: Send data
deactivate System
@enduml
